Revit 2025 API
ExternalDataInstanceAddingIntoDocumentEventArgs.TypeId Property
 The type id of the newl external data instance that is being added.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ElementId TypeId { get; }
Public ReadOnly Property TypeId As ElementId
	Get
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
member TypeId : ElementId with get
Property Value
ElementId
See Also
Reference
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace